test/multiphase/reactingMultiphaseEulerFoam/populationBalanceModeling/simultaneousCoalescenceAndBreakup/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingMultiphaseEulerFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.1;

writeControl    runTime;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;

maxDeltaT       1;

functions
{
    box.all.numberDensity.volume.bubbles
    {
        type                sizeDistribution;
        functionObjectLibs  ("libreactingEulerFoamFunctionObjects.so");

        writeControl        outputTime;
        writeInterval       1;
        log                 yes;

        functionType        numberDensity;
        abszissaType        diameter;
        regionType          all;
        populationBalance   bubbles;
        normalize           true;
    }

    box.all.volumeDensity.volume.bubbles
    {
        type                sizeDistribution;
        functionObjectLibs  ("libreactingEulerFoamFunctionObjects.so");

        writeControl        outputTime;
        writeInterval       1;
        log                 yes;

        functionType        volumeDensity;
        abszissaType        diameter;
        regionType          all;
        populationBalance   bubbles;
        normalize           true;
    }
}

// ************************************************************************* //
